Revit 2027 API
CriticalPathIterator.GetCurrent Method
 Gets the analytical segment id at the current iterating position.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPNetworkSegmentId GetCurrent()
Public Function GetCurrent As MEPNetworkSegmentId
public:
MEPNetworkSegmentId^ GetCurrent()
member GetCurrent : unit -> MEPNetworkSegmentId
Return Value
MEPNetworkSegmentId
 The segment id of the current iterating position.
See Also
Reference
CriticalPathIterator Class
Autodesk.Revit.DB.Analysis Namespace